#+TITLE: Tom's Emacs Init File
 
So this is fun. Let's get started by adding my custom folders to my
load path:
 
** Debugging

#+BEGIN_SRC emacs-lisp 
  (setq debug-on-error 1)
#+END_SRC

#+RESULTS:
: 1

** Package Management
 
Here's where I install local packages:
 
#+BEGIN_SRC emacs-lisp 
  (let ((default-directory  "~/.emacs.d/customizations/packages/"))
    (normal-top-level-add-subdirs-to-load-path))
 
  (add-to-list 'load-path "~/.emacs.d/customizations/lisp/")
#+END_SRC

#+RESULTS:
| ~/.emacs.d/customizations/lisp/ | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/site-lisp | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/site-lisp | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/vc | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/url | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/textmodes | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/progmodes | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/play | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/org | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/nxml | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/net | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/mh-e | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/mail | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/leim | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/language | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/international | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/gnus | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/eshell | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/erc | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/emulation | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/emacs-parallel | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/emacs-lisp | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/cedet | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/calendar | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/calc | c:/ProgramData/chocolatey/lib/Emacs/tools/share/emacs/24.5/lisp/obsolete |

 
I guess I'll add the melpa stuff even though I don't think I can 
use it:
 
#+BEGIN_SRC emacs-lisp
  (require 'package) ;; You might already have this line
  (add-to-list 'package-archives
               '("melpa" . "http://stable.melpa.org/packages/"))
  (package-initialize) ;; You might already have this line
#+END_SRC

#+RESULTS:
: t
 
** Global Properties
 
Open everything in Firefox:
 
#+BEGIN_SRC emacs-lisp
  (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program "C:/Program Files (x86)/Google/Chrome/Application/chrome.exe")
#+END_SRC

#+RESULTS:
: C:/Program Files (x86)/Google/Chrome/Application/chrome.exe
 
Now on to Org

** System Path

Since I usually don't start Emacs from the command line I need to
append some of my custom apps to the Emacs path.

#+BEGIN_SRC emacs-lisp
  (setq chocolatey-root "c:/ProgramData/chocolatey")
  (setq chocolatey-lib
	(concat chocolatey-root "/" "lib"))
  (setq chocolatey-bin
	(concat chocolatey-root "/" "bin"))
  (setenv "PATH"
	  (concat
	   "C:/Program Files/Git/bin" ";"
	   "C:/Python27" ";"
	   "c:/ProgramData/chocolatey/bin" ";"
	   (getenv "PATH")
	   )
	  )
#+END_SRC

#+RESULTS:
: C:/Program Files/Git/bin;C:/Python27;c:/ProgramData/chocolatey/bin;c:/Users/tom.purl/AppData/Roaming/.virtualenvs/tdd-django/Scripts;C:/Program Files/Git/bin;C:/Python27;c:/ProgramData/chocolatey/bin;C:\Program Files\Docker\Docker\Resources\bin;C:\Program Files (x86)\Tesseract-OCR;C:\Program Files\Git\cmd;C:\WINDOWS\system32;C:\Strawberry\c\bin;C:\Strawberry\perl\site\bin;C:\Strawberry\perl\bin;C:\Program Files\TortoiseGit\bin;C:\Users\tom.purl\AppData\Local\Programs\Python\Python36\Scripts\;C:\Users\tom.purl\AppData\Local\Programs\Python\Python36\;C:\Users\tom.purl\AppData\Local\Microsoft\WindowsApps;C:\tools\cmder;C:\Program Files (x86)\Nmap;C:\Program Files (x86)\Sophos\Sophos SSL VPN Client\bin

*** No extra lines between headers
Org sometimes adds an extra line between headers, which drives me
nuts. This fixes that:

#+BEGIN_SRC emacs-lisp
  (setq org-blank-before-new-entry
	'((heading . nil) (plain-list-item . nil)))
#+END_SRC

#+RESULTS:
| heading         |
| plain-list-item |

*** Specify the files that can be used in an agenda
 
#+BEGIN_SRC emacs-lisp
  (defun set-org-agenda-files ()
    (interactive)
    (message "Saving all org buffers to keep agenda files list clean")
    (org-save-all-org-buffers)
    (setq org-agenda-files (list "~/org"))
    (message "Done setting org agenda files."))

  (set-org-agenda-files)
#+END_SRC
 
#+RESULTS:
: Done setting org agenda files.
 
*** Custom Views
 
Here's my custom agenda view that uses "column view". 
 
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-overriding-columns-format
        "%TODO %4PRIORITY(Pri.) %50ITEM(Task) %3POM_Estimate(Est.) %6POM_Pomodori(Poms) %6POM_Interruptions(Ints) %TAGS %12CLOCKSUM_T(Today's Time) %12CLOCKSUM(Total Time)")
  (setq org-agenda-view-columns-initially t)
  (setq org-agenda-custom-commands
        '(("." "Simple agenda view"
           ((tags "+today"
                       ((org-agenda-span 'day)
                        ))
            (agenda "")))))
#+END_SRC
 
#+RESULTS:
| . | Simple agenda view | ((tags +today ((org-agenda-span (quote day)))) (agenda )) |
 
This only shows today's tasks in the agenda view by default:
 
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-span 1)
#+END_SRC
 
Finally, this appears to be necessary to get the =clocksum= functions
to run properly on startup:
 
#+BEGIN_SRC emacs-lisp
(org-clock-sum)
#+END_SRC
 
*** Projects
 
Since this is an alist I don't know how to embed functions in
it. Thats's why I've replaced the org-directory var with the literal
value.
 
#+BEGIN_SRC emacs-lisp
  (setq org-publish-project-alist
        '(
          ("org-notes"               ;Used to export .org file
           :base-directory "~/org/"  ;directory holds .org files 
           :base-extension "org"     ;process .org file only    
           :publishing-directory "~/org/public_html/"    ;export destination
           :recursive t
           :publishing-function org-html-publish-to-html
           :headline-levels 4               ; Just the default for this project.
           :auto-preamble t
           :auto-sitemap t                  ; Generate sitemap.org automagically...
           :sitemap-filename "sitemap.org"  ; ... call it sitemap.org (it's the default)...
           :sitemap-title "Sitemap"         ; ... with title 'Sitemap'.
           :export-creator-info nil    ; Disable the inclusion of "Created by Org" in the postamble.
           :export-author-info nil     ; Disable the inclusion of "Author: Your Name" in the postamble.
           :auto-postamble nil         ; Disable auto postamble 
           :table-of-contents t        ; Set this to "t" if you want a table of contents, set to "nil" disables TOC.
           :section-numbers nil        ; Set this to "t" if you want headings to have numbers.
           :html-postamble "    <p class=\"postamble\">Last Updated %d.</p> " ; your personal postamble
           :style-include-default nil  ;Disable the default css style
           :html-head "<link id='pagestyle' rel='stylesheet' type='text/css' href='static/css/org.css' />"
           
           ("org-static"                ;Used to publish static files
            :base-directory "~/org/static/"
            :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
            :publishing-directory "~/org/public_html/"
            :recursive t
            :publishing-function org-publish-attachment
            )
           ("org" :components ("org-notes" "org-static"))) ;combine "org-static" and "org-static" into one function call
          ))
#+END_SRC

#+RESULTS:
| org-notes | :base-directory | ~/org/ | :base-extension | org | :publishing-directory | ~/org/public_html/ | :recursive | t | :publishing-function | org-html-publish-to-html | :headline-levels | 4 | :auto-preamble | t | :auto-sitemap | t | :sitemap-filename | sitemap.org | :sitemap-title | Sitemap | :export-creator-info | nil | :export-author-info | nil | :auto-postamble | nil | :table-of-contents | t | :section-numbers | nil | :html-postamble | <p class="postamble">Last Updated %d.</p> | :style-include-default | nil | :html-head | <link id='pagestyle' rel='stylesheet' type='text/css' href='static/css/org.css' /> | (org-static :base-directory ~/org/static/ :base-extension css\ | js\ | png\ | jpg\ | gif\ | pdf\ | mp3\ | ogg\ | swf :publishing-directory ~/org/public_html/ :recursive t :publishing-function org-publish-attachment) | (org :components (org-notes org-static)) |

** Yasnippet
#+BEGIN_SRC emacs-lisp
  (defun yas/org-very-safe-expand ()
    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))
 
  (add-hook 'org-mode-hook
            (lambda ()
              (make-variable-buffer-local 'yas/trigger-key)
              (setq yas/trigger-key [tab])
              (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
              (define-key yas/keymap [tab] 'yas/next-field)))
#+END_SRC

#+RESULTS:
| (lambda nil (make-variable-buffer-local (quote yas/trigger-key)) (setq yas/trigger-key [tab]) (add-to-list (quote org-tab-first-hook) (quote yas/org-very-safe-expand)) (define-key yas/keymap [tab] (quote yas/next-field))) | #[nil \300\301\302\303\304$\207 [org-add-hook change-major-mode-hook org-show-block-all append local] 5] | #[nil \300\301\302\303\304$\207 [org-add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Org-pomodoro
 
#+BEGIN_SRC emacs-lisp
(setq org-pomodoro-keep-killed-pomodoro-time 't)
 
; Show a popup every time a pom is completed.
(add-hook 'org-pomodoro-finished-hook
          (lambda () (shell-command "c:\\Users\\pp87775\\Documents\\Dev\\PS\\show-pom-end-popup.bat" nil nil)))
(add-hook 'org-pomodoro-break-finished-hook
          (lambda () (shell-command "C:\\Users\\pp87775\\Documents\\Dev\\PS\\show-break-end-popup.bat" nil nil)))
#+END_SRC

#+RESULTS:
| lambda | nil | (shell-command C:\Users\pp87775\Documents\Dev\PS\show-break-end-popup.bat nil nil) |

 
...and duh.
** Org bullets
Of course you need these :smile:
 
#+BEGIN_SRC emacs-lisp 
  (require 'org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

#+RESULTS:
| (lambda nil (org-bullets-mode 1)) | (lambda nil (make-variable-buffer-local (quote yas/trigger-key)) (setq yas/trigger-key [tab]) (add-to-list (quote org-tab-first-hook) (quote yas/org-very-safe-expand)) (define-key yas/keymap [tab] (quote yas/next-field))) | #[nil \300\301\302\303\304$\207 [org-add-hook change-major-mode-hook org-show-block-all append local] 5] | #[nil \300\301\302\303\304$\207 [org-add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

*** Rainbow Delimiters

 #+BEGIN_SRC emacs-lisp
   (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
 #+END_SRC

 #+RESULTS:
 | rainbow-delimiters-mode |
